package com.teachMeSkills.lesson9.task5;

/**
 * Дана произвольная строка.
 * Вывести на консоль новую строку, которой задублированно каждая буква из начальной строки.
 * Например, "Hello" -> "HHeelllloo"
 */
public class Main {

    public static void main(String[] args) {

        String str = "New Day";
        System.out.println(NewString.getNewString(str));

    }

}
